{
    "title": [
        "The Drain",
        "The Night I Came to Know the Boy Across the Street Wasn’t Alive",
        "Creepy delivery driver",
        "I would like to know about your paranormal experiences",
        "The Dots",
        "“Good boy”",
        "Tales of the Blood Moon ",
        "Stollwurm of South Carolina",
        "[Part 4 | Ending] I'm being stalked by someone from a genealogy website",
        "Loop?"
    ],
    "body": [
        "I had the dream again tonight. It seems to be coming more frequently now as we get closer to your arrival. Daddy says that it’s got to have something to do with the hormones or morning sickness. He’s always been practical that way and it’s one of the many reasons I love him and why he’ll be such a good father to you. When he looks at a problem he sees the edges of it, so clearly defined. But how do I tell a person like that the truth, how do I make him understand? \n\nI could tell him that right when I wake I can’t tell if I’ve truly left the dream. That I can feel the distorted images of my sleeping mind clinging to my skin like wet bandages. I could tell him that when I stumble through the predawn and fall to my knees before our toilet bowl that it’s not morning sickness which causes me to coat its porcelain interior but fear. Not a measured fear, not the fear of a practical person, but the panicky weightless fear of a small child. I could tell him that as I kneel on the cool tile floor I often sneak furtive glances across the bathroom and watch the empty pit where our sink would be in daylight and pray that I do not hear my name called out from within it.\n\nI could tell him all of this and maybe he would believe me and maybe he would even know what to do. But none of that is the kind of thing you tell a practical person. That story has no clear edges.\n\nSo I close the toilet lid and lay my head against its cool surface and feel the nausea seep out of my core. I wait for clarity to reassert itself in my mind, the cobwebs of sleep dusting themselves into nothingness, and then I flush the toilet and make my way back to the bedroom. But as I leave the washroom I can’t help but notice that I lean subtly towards the outer wall, away from the vanity and our shared sink which it holds. \n\nUntil the pregnancy I had always been one to sleep through the night but I find now that once fully awake, no matter the time, I’m up for the day. Still it’s too early to start my morning and, though it’s not as restful as sleep, returning to the bed does relieve some of the strain in my back. There’s a small added grace there too in that I get to spend time alone with you. \n\nI lay back in a half seated position, close my eyes and lay my hands across the swell of my belly. I breathe slowly, rhythmically, and imagine that I can feel your heartbeat synchronizing with mine. \n\nI begin to talk to you, not out loud as I don’t want to wake Daddy but in my thoughts. I tell you about myself and about the world and everyone who is waiting so anxiously to meet you. I explain how you are now the size of a sweet potato and how we’ll be going to the doctor today to check in on you. I imagine your future and all the amazing things you will accomplish. I make sure you understand that all I want of you is to be happy and healthy and caring. And then sometimes, very rarely but with a growing frequency, I hear you reply. You call to me from within myself and images flash across the vista of my mind which I swear are not of my own creation. It is in these moments that I feel nearest to you. \n\nI know that what I am experiencing isn’t reality but neither is it a dream. I can’t go back to sleep once awake but our little talks set me at such ease I enter a sort of trance state, half dreaming half waking, such that I don’t notice the morning light as it creeps across our bedroom and when daddy wakes and kisses you through my belly I come to in a start.\n\n“Oh shit I’m sorry Liz I didn’t mean to scare you,” he says pulling back from my torso. “Are you okay hun, did you get enough sleep?”\n\nI nod and smile. Daddy smiles back but as he slides off the bed and moves towards the ensuite I notice his eyes flit back to my face. The look is searching and concerned.\n\nThe lack of sleep, the pains, the general rigor of growing you within myself has all taken its toll on my body. I know it shows in the darkening rings under my eyes, in the lines that deepen on my face, and I know Daddy notices and I know he worries. I love him for that. But we both understand it will all be worth it in the end when we finally get to meet you. \n\nI try to relax and force the skin of my face to smooth. I stare ahead at the blank wall of our bedroom and listen as Daddy releases a stream of urine into the toilet bowl. He didn’t lift the lid but I won’t say anything this time, he has enough to worry about and worry is a cousin of anger. I don’t want to fight this morning, I don’t want to fight with you inside me. I don’t want to play out the events of the dream.\n\n“So doctor today right babe?” Daddy calls from the bathroom. “It’s the twenty…one week checkup, yeah?”\n\nTwenty two, it’s the twenty-second week. The thought materializes absently, mostly ignored by my working mind. I focus instead on the toilet flush and the sound of Daddy’s bare feet as they move across the tile floor towards the sink. I realize I’m holding my breath and think, bizarrely, how in that way I’m holding your breath too. Then daddy cries out.\n\n“Ahh jesus!”\n\nI watch my hands, laid protectively over you, as they break out in goose flesh. I know that I could ask him what’s wrong but what would be the point? This is all so repetitive, a recitation of the message relayed to me by dreams.\n\n“Liz!” \n\nDaddy calls me and I refuse to answer. If I do not speak then we cannot progress, the end must remain as the end. I will not speak and in my silence I will not lose you.\n\n“Oh Lizzie…you couldn’t make it to the toilet my darling?”\n\nThe words are wrong but that’s not what brings an end to my dissociation. It’s the care I hear in Daddy’s voice. When I near the end of the dream Daddy speaks to me, yes, but in roaring tones of anger and horror not kindness, never care. \n\nI rise from the bed and walk the short distance to the washroom. Daddy stands before the sink, I tell myself I will not look but as he moves his gaze downwards I follow, slowly, obediently. I steel myself for what awaits me.\n\nBut this is not the dream. The sink is empty, or nearly empty. A faint outline coats the porcelain, burnt yellow like the last of fall’s leaves and tendrilous - reaching from the drain in unmeasured jabbing spurts towards the rim of the sink. It’s a stain, a stain that so easily could have been the residue of my morning sickness. An explanation so simple, a connection so natural. And yet I know that when I vomited in the early hours I did so into the toilet. I’m certain of that.\n\nTears come then and Daddy holds me tightly. We are still pressed together when we feel you kick. Daddy beams at me and I force myself to smile back. This is a first for him, to actually feel your movement, and it sends him off on an excited tangent about what sports you will play. Only I know that this is not a rarity. Whenever I approach the sink I feel you reach out for it.\n\n###\n\nThe sign on the outer door of the office reads Dr. Ahmad, printed in stark gray letters, but the middle aged woman who smiles as she applies gel to my distended belly has reminded me more than once to call her Amira.\n\nDaddy has told me before that a friend from work swears by Dr. Ahmad, that she is the best obstetrician in the city and that he would settle for nothing less. I couldn’t say if that is all true but I do know that she always runs warm water over her hands before donning her latex gloves and touching my skin. I know that she hums prettily along to the radio as she maneuvers her wand along my torso and that this makes me feel at ease. I know she smells faintly of sandalwood.\n\n“Lizzie?” Daddy is staring at me. “Did you hear what Dr. Ahmad said?”\n\n“Oh no I’m sorry Dr. Ahm- I’m sorry Amira. Mommy brain. What were you saying?”\n\nAmira smiles at me. Her eyes are kind, a warm brown color like strong coffee, eyes that have seen many mothers through this same journey. I think briefly how there is a sadness in that, I wonder if she regrets turning a miracle into mundanity. I wonder if she has carried children of her own.\n\n“I was saying, Elizabeth, that in regards to your child I am very pleased with the results of today's tests. The ultrasound shows me that we are dealing with a healthy, well formed baby.” I open my mouth to vocalize relief but Amira cuts off my reply. “I am not, however, satisfied with your condition. Your stomach has grown along expected lines but you have lost weight elsewhere. I can see that you are under an unusual strain, it is clearly written in those dark bags under your eyes. It seems to me as though you are wasting away. This is not-“\n\n“I’ve told her all this doctor,” I watch frustration flash across Amira’s face as Daddy interrupts her, “Well I did, didn’t I Liz?”\n\n“This is not,” Amira continues, ignoring Daddy, “strictly indicative of a larger problem but it is concerning. Most concerning is that the cause of these symptoms is not of a medical nature. Now I know that it is not uncommon for first time mothers to focus so greatly on the health of the child they carry that they lose sight of the fact that their own health is paramount. You are one being, the baby takes its life from you. We must have you well rested and well fed. Can you think of anything that may be causing you undue stress?”\n\nI see the drain, just a blip, flash across my mind. The thought is not my own, the picture appears unbidden. I feel you kick within me.\n\n“No,” I lie, “There’s nothing that comes to mind.”\n\nAmira watches my face. She looks from me to Daddy and back then nods and wheels her chair back to her desk. She picks up a stack of paper and returns to the bedside.\n\n“Mr. Hamilton, would you kindly bring this to the nurse’s station? The sooner we file your wife’s results the sooner you can get her back to the comfort of your home and I would like to finish my assessment in the interim.”\n\nI see in his hesitation that Daddy doesn’t understand, or doesn’t like, Amira’s request but we all know that he can’t argue against its logic. Without saying a word he takes the sheaf and exits the room. Amira watches Daddy go then picks up the phone from her desk and presses a button.\n\n“Hello, yes, Anna I’m sending Mr. Hamilton out to you. I wonder if you could hold him at the desk for ten minutes or so? Yes, a possible code violet. Thank you Anna.” Placing the handset back in its cradle Amira turns back to me. “Elizabeth, will you please tell me what is troubling you? If your husband is the cause of your condition, if he is abusing you, then we must take steps to ensure your protection.”\n\nThe suggestion is so absurd I do not immediately respond. Amira waits, staring at me expectantly.\n\n“No! Dr Ahma- I’m sorry, Amira,” I begin, “that couldn’t be further from the truth! Dan takes very good care of me and clearly you can’t see it but he’s just as concerned as you are. He has absolutely nothing to do with this. My problem is...the issue isn’t Dan. ”\n\n“I didn't mean to make a hurtful accusation, Elizabeth. I simply need to examine all possible causes and I prefer to start with that which may be most harmful. So you do know what the problem is then?”\n\nI have cornered myself. The image of carrying you to term within the padded walls of an asylum cell comes momentarily to mind. No, I trust Amira, I trust in her kindness. I don’t know if she will believe me, like Daddy she is a practical person, but I do believe she will not punish me for something so out of my control. And perhaps this is the help I’ve been so desperately seeking. I exhale and begin.\n\n“Amira, do you believe that dreams may act as a kind of warning?”\n\n“Hmm,” the doctor’s look is guarded but she continues, “I have read studies that broach the subject, yes. Something about our subconscious mind picking up data of which our conscious mind is unaware then regurgitating the information in the form of dreams. I can’t speak to the validity of the experiment but-”\n\n“No, sorry, I mean do you think we can be given a glimpse of the future through our dreams?”\n\nThis step into the murky world of pseudo occultism draws only a tight lipped smile from the doctor. I continue undaunted.\n\n“I’ve been having a recurring dream. I know it sounds ridiculous but I think…I think it’s a kind of portent of what’s to come.” Amira slowly nods at me to continue. “It always begins the same way. I wake up early in the morning, well before dawn, and I’m up because I’m experiencing terrible nausea. It’s worse than morning sickness, worse than food poisoning even, it feels like my insides are burning and my stomach is going to burst open at the belly button. I rush to the washroom then-”\n\n“Is this taking place in your current home,” Amira clarifies, “as it is now?”\n\n“Yes, exactly. Just as it is now. I have trouble distinguishing it from real life. There's none of the…looseness or randomness of dreams, it’s simply my bedroom, my life.”\n\n“What happens then?”\n\n“Then I stumble into the washroom and the pain is growing and growing. And I need to relieve it and I know that I have to go to the toilet to vomit but I stop myself at the vanity because…” \n\nAmira allows the silence to linger uncomfortably then prompts. “Because?”\n\nHow do I continue? Hearing the dream described for the first time in the light of day only exaggerates its absurdity. I lay my hands around you and tell myself that crazy or not, believed or disbelieved, I have to finish if only to ensure your safety.\n\n“Because I hear my name. Called out. It’s quiet at first, a whisper so light I can’t even tell if it’s real. Something like…liiiiiissss. I search the bathroom for the source of the sound but there’s nothing. I'm completely alone. I become frantic, it's driving me crazy and almost in response the call gets louder and louder. Liz, Liz, LIZ, LIZ! I notice the echo then. The echoing wetness of the sound and it draws my attention to the sink and then I realize the thing is…is in there. Down in the pipes, down in that darkness, and it’s calling out to me.  At this point each repetition of my name blends together until it’s all one undistinguishable buzzing resonance. A sound or a chant which rings through me like something fetid and ancient…older than religion older than music. And I can’t, I can’t control myself. The sound is in me. Moving me. So I climb atop the vanity and I…I feel the thing grasping with its cold wet tentacles. And it’s moving up my body and I realize it doesn’t want me at all. I’m just a vessel to it. And then it…it…”\n\n“What does it do Liz?”\n\n“It…takes the baby. It takes the baby out of me…and I…I thank it because then the pain is gone.”\n\nAmira sits still staring at us for a very long time. In the throes of my retelling I began to focus on the middle distance but now, emotionally spent but focused once more on the woman in front of me, I am relieved to realize the kindness has never left her eyes. She shifts her gaze downwards to the point where my hands clasp protectively in front of you then returns them to meet my face.\n\n“This is troubling, to put the situation mildly. Do I believe that this is a glimpse of the future revealed to you? No, of course not,” I feel foolish but Amira continues reassuringly, “but that doesn’t mean I will not help you Liz. Whatever the reason for its recurrence, or its questionable importance, the dream clearly has a negative effect on you. I am not a trained psychologist but I may be able to treat the physical maladies this dream has caused.”\n\nAmira swivels back to her desk and retrieves a small paper pad and begins to scribble on it.\n\n“I am writing you a prescription for a low grade valium derivative. This would not regularly be advisable in the treatment of a pregnant patient but in this case I believe special measures must be undertaken. Take one pill before you sleep and you should pass the night without dreams.” I reach for the prescription but before I can grasp it Amira pulls the paper away. “This is only a treatment of the symptom, not a cure. You must rest, you must eat, you must relax. Without extending into fields in which I am no expert your dream is obviously the creation of a scared strained mind and contains no truth. No truth other than this, you are your child's vessel and as such must maintain yourself to ensure the baby’s health.”\n\nI can feel tears coming then but fight them back. I see emotion displayed in the doctor’s face as well though whether it is pity or fear I cannot tell. She hides herself too well.\n\n“Thank you Amira. Thank you so so much I can’t tell you-”\n\nOur conversation is cut short as the door to Amira’s small office slams open. Dan stands in the doorway fury plainly labeled in the expansive whites of his eyes, the bovine flair of his nostrils.\n\n“How dare you!” He bellows as he crosses the room to step in between Amira and myself. “Your nurse…me an abusive husband!? Liz grab your things my darling, we are leaving and we are never coming back!”\n\n“Mr. Hamilton I had to take all-”\n\n“Save it! But you better believe I’ll be spreading word of this! I am going to flood your reviews lady. I’m telling everyone I know to stay well clear. I’m going to ruin you!” \n\nDaddy has bundled us up now and is quickly moving our small family unit out the door and into the hall. He saves whatever parting barb he had in mind, employing instead his most thunderous scowl. I try to catch a final glimpse of Amira before I cross the threshold, to make her see how sorry I am, but all I can make out is the gray streaks in her dark hair floating above Daddy’s shoulder like seagrass in the moonlight.\n\n###\n\nI am not afraid, I tell my reflection in the mirror, the dream is a dream. Nothing more.\n\nI stand before the vanity of our ensuite and cautiously lower my hands to its marble surface. The counter is cold but reassuringly solid under my weight. This is reality, this is normalcy. The small green pill stares back at me from beside the sink, unblinking as a malevolent eye. \n\nI lower my head to the sink basin and hover my ear above the drain. I restrain the urge to scream into the hole and wait. Nothing. Of course there is nothing, for a week now there has been nothing. No dreams, no nausea, no voices in the drain. All as it should be and all thanks to Dr. Amira’s tablets. \n\nI’ve started gaining back weight and the dark circles under my eyes have begun to clear. Sleep is a black void but it lasts the night through and I feel at least partially rested when I wake. There is one negative side effect however. I no longer hear from you. We cannot convene in the early hours, my mind is my own, and I find myself speaking to you less and less. It is sad but your safety is the priority. Still I miss our connection. I lift my belly up towards the drain but the only reaction it elicits is a gurgle in my stomach. You have gone quiet.\n\n“Hun you coming to bed?” Daddy asks from the outer room, “could you turn the light off when you come over?”\n\n“Of course, just a sec.” I respond as I take the pill and dry swallow it with a grimace.\n\nThe medication is hidden from Daddy in my makeup bag, though I’m not sure he would care even if he knew. After his outburst at Dr. Amira’s office he has become reluctant to involve himself with anything pregnancy related. Don’t think for a second this means he loves you any less, he’s only embarrassed. Daddy just needs time to lick his wounds.\n\nAs I enter the bedroom and turn off the overhead light I can feel the first hints of the pill working its way through my system. My eyelids begin to lag and my thoughts become muddled. Daddy speaks to me and I mumble a response, the words forgotten as soon as they leave my lips. I lie my head on the pillow and feel the black rush of unconsciousness descend upon me like a wave. I am asleep before Daddy has turned off his bedside lamp.\n\nThe pain is not what wakes me nor the chill which has crept across my uncovered skin. It is the faint sense of movement which pulls me from the darkness.The incremental sliding of hardwood floor against my skin. \n\nMy initial response is one of confusion. Questions flood my mind; Where am I? Where is Dan? Why am I on the floor?\n\nThe thoughts come sluggishly and I realize with stupid slowness that the drug must still be cavorting through my system. Panic begins to rise from my stomach but I fight it back. I cannot let fear seize me before I understand what is happening.\n\nI ask my eyes to open but the command is only half acknowledged, my left eyelid parts sluggishly while the right stays pressed against the floor.  All I can make out from my half open eye is wood grain moving by in uneven lurches and the moonlight which plays along the baseboards. I attempt to lift my head but only succeed in pressing out a groaning mumble which sounds as if it were spoken by another’s mouth. I cannot call for Dan. My groans are nowhere near loud enough to wake him. I am alone. \n\nIt is then that pain cuts through the pill induced fog and rings out loud and true. What the drug had hidden from me till now is a sharp repeated two pronged jab which tears against the interior lining of my womb. I want to scream but the gummy bloating of my vocal chords prevents me. Instead I focus on the sensation and allow it to drive the last of the confusion from my mind. The truth this clarity brings makes me wish I could return to the oblivion of medically induced sleep forever.\n\nI realize then that the pain inside my body is associated directly with my slow movement across the floor. With each stab my flesh is pressed against the hardwood and dragged backwards propelling the entire unit inch by excruciating inch forward.\n\nLimited control is returning to my body now and with difficulty I am able to push my head upwards in the direction of my unintended destination. The black mouth of our bathroom doorway yawns before me. \n\nThe dream is a dream.\n\nI see now. I can feel the minute variations in pressure against my organs, the tickling points of internal contact that hide beneath the pain. \n\nIt’s you. I feel your hands as they push against me from within, your feet as they kick against my ribs. You have always yearned for the drain or perhaps the thing that lives within the drain has always yearned for you. But now Amira’s work has blocked your progress. The pill disabled your vessel, made communion impossible so you took the matter up yourself as best you could.\n\nMy stomach flips and saliva fills my mouth. I allow it. The contents of my stomach spill across the floor and whether a placebic or truly cleansing act I feel fine motor control begin to spread throughout my body. I am finally able to halt your progress by turning onto my back just as we breach the doorway to the bathroom. The effort leaves me soaked in sweat and pain radiates from my torso. I close my eyes against the waves of agony.\n\nA faint glow spreads across my eyelids, a sickly green which speaks of forgotten things long shunned from the natural light of day. I feel rather than hear the shuddering vibrations of the drain pipe as your unknowable friend makes its way upwards towards us. You are still, the pain ends abruptly, you know the time is at hand.\n\nI scramble backwards away from the vanity pushing my back up against the far wall, my eyes closed all the time. Low moans escape from me but the echoing scream I truly desire to create seems momentarily to elude me. Instinctively my hands come down to protect you but the wriggling ambulations I feel there send another wave of nausea through me and I pull my hands away as if scalded. The green light grows brighter and I shield my face against it. Where it touches my skin it seems to leave a greasy residue. \n\nThe sound of the thing is all around us now, it’s scratching grasping appendages snaking out over the tile of the bathroom. I breathe in its odor, a musk of rotting forgotten things long since washed or flushed away into the blind madness of its subterranean sewer world. I recoil as the first cold tentacle brushes along my bare foot. I feel you inside me shuddering wildly at the things touch, reaching back towards it. In that moment, given the proper tool, I would have cut you out myself.\n\nThen I hear the voice, quiet at first but steadily growing as its purchase in our world solidifies. Solidifies within you.\n\nLissssssssss.\n\nI scream then.\n\nI scream until the sound dies within me. Then I am left humming tunelessly, swaying beside the toilet. This is where Daddy will find me. Daddy who sees such straight lines, Daddy who will ignore the unknowable and instead focus on nursing me so carefully back to health. Daddy who will help me through the last few painful months of your delivery. \n\nDaddy who I know is no longer your daddy.\n",
        "*( It might be disturbing. )*\n\nAlright, here it goes—this is something that happened to me a few years back, and honestly, it still creeps me out just thinking about it. I’m not the kind of person who jumps to conclusions about ghosts or spirits, but this experience really made me question some things.\n\nSo, this was back when I was around 19. My dad had just gotten transferred to this small town. It wasn’t anything major, just one of those routine government transfers. We moved into this old house in front of this other house—like, right across the street. It was a quiet neighborhood overall, the kind of place where people keep to themselves and don’t bother much.\n\nBut there was something about that house across the street that gave me a weird vibe from the start as soon I spent first night in our new home. Not that it looked haunted or anything—no, it looked normal, just old and a bit worn down. (Okay, maybe it was a little creepy at night, but that’s because it was always dark, like no one ever turned on a light there.)\n\nThe first few days after we moved in were fine. Nothing strange happened. We were busy unpacking, getting used to the new place. But one night, after a long day of helping my dad arrange the furniture and all, I decided to sleep on the roof. Because it was summer, and it was way too hot inside the house, as you would expect in India, so the roof seemed like the best option.\n\nI set up a small bed on the *charpai* (one of those traditional Indian rope beds), grabbed my phone, and lay down, staring at the stars. It was peaceful for the most part. But then, as I was about to drift off, my eyes fell upon the window of the house across the street and it gave me the sensation (as in general horror films) like someone was watching me.\n\nAt first, I thought I was just being mistaken . (I mean, who wouldn’t feel a little weird sleeping out in the open like that) But then, I noticed something. The window of the house across the street—it was open. Now, that wouldn’t have been weird, except for the fact that I had never seen anyone in that house before. It always looked empty. No lights, no people, nothing. But that night, I could swear I saw someone standing near that window.\n\nI sat up, squinting to get a better look, but it was too dark to see clearly. Whoever—or whatever—was there didn’t move. I figured it must be my imagination playing tricks on me, so I lay back down and tried to sleep. But I couldn’t shake the feeling. It was like there was something wrong, something…off.\n\nThe next morning, I asked my dad if he had seen anyone living in that house. He gave me a weird look and said no, that the house had been empty for a while. Apparently, the last family that lived there moved out about a year ago, and no one had taken up residence since. Without being filmy curious, I just ignored it, thinking maybe I was just tired the night before. Maybe I’d imagined the whole thing.\n\nBut then it happened again. A couple of nights later, I was back on the roof, trying to get some sleep. And again, that same feeling—like someone standing at the window, was watching me. This time, I didn’t hesitate. I looked straight at the window across the street, and there he was. A boy, standing in the window, just staring at me, surely without much motion, but enough to seem a living being. He looked young, maybe my age or a bit younger. His face was pale, and he just stood there.\n\nRead full story —> [The Night I Came to Know the Boy Across the Street Wasn’t Alive](https://verdaily.com/the-night-i-came-to-know-the-boy-across-the-street-wasnt-alive/)",
        "(I though this would be good here so I’m posting it)\n\nWhen I was 16-17 I had a job in a dessert bar place I normally worked night which was scary enough but I didn’t make it better when delivery drivers would randomly walk in a make me jump after seeing them, not expecting them there. One day a driver came in like normal I gave him the order and he left giving me a creepy smile. I told my co workers I got a weird vibe from him but they all shrugged it off saying I was paranoid. Every time the driver came in he would always give me a smile even if I wasnt behind the counter.\n Context, I would always clean the floor where guest would eat every night. this was known as my part of cleaning so no one else would do it, I would also go through a door and clean the bathroom hallway that you couldn’t see me from if you just looked around. Every time I cleaned the floor this guy would always give me a smile, I swear it always got creepier but my co workers again would brush it aside. One day he walked up to me and gave me something simple saying “give this to your coworker”. I got scared as he walked away and immediately threw it away and told my co workers, at this point they did get worried. Another day while I was cleaning the hallway he walked through and stared at me for a while before saying “I’m just using the bathroom” I never spoke to him or anything so it felt like he was just saying it to not seem creepy. Then when I was done with the hallway I walked out and told my coworkers which they told me he hasn’t been in the shop yet.\n After a few weeks of this he just stopped showing. I quit the job not long after and now keep thinking of this. I still go to the dessert place to get myself things and never see him. I asked a coworker if he still comes here and they said “who? No one has ever came here like that”   My co workers ashamed I was talking about a different driver and I told them no and explained the guy and they confirmed no one like that had ever picked up a delivery. \nafter maybe 2 months I went into town and saw him walking out of the dessert place clearly upset until he saw me. He smiled widely and waved and I got the same creepy vibes and quickly walked of. \nAs of now idk if he was made up in my head or just a random guy who just liked younger women\n\n(I had told him my age at one point hoping he would stop but he never did)",
        "I have never had this type of experience and I am curious to know what you did when you saw, heard or felt something you could not understand. Did you do something to attract this?",
        "It’s a typical summer day in eastern Oregon—sunny with a touch of overcast. The freeway stretches straight for miles, cutting through barren farmland. A man in his 30s drives eastbound, listening to a podcast through the speakers of his 2001 Subaru station wagon. Moments later, his windshield cracks, blood splatters the interior, his chest is pierced, and his rear window blows out—all in an instant. His lifeless body slumps against the steering wheel as the car drifts into the sandy median, smashing into the catch cables with a sickening crunch. Minutes later, a semi-truck approaches the scene, but suddenly its grill and engine block explode. The driver is thrown against the dash as the airbags deploy. Fire erupts, consuming the cab and the fuel payload. The truck continues to roll in flames off the freeway.\n\nDrivers on the freeway freeze, eyes wide in shock at the destruction before them. Emergency services arrive quickly. While firefighters battle the flames, police officers redirect traffic and investigate the station wagon. In the chaos, a police cruiser inches through the scene, avoiding fire hoses and personnel. Suddenly, the cruiser’s windshield cracks under immense pressure, bending inward. The officer slams on the brakes and leaps out in panic. Staring in disbelief, they see a pitch-black sphere—no reflection, no movement—an inch in diameter, impossibly lodged against the glass. Other officers rush over. They pull the cruiser back slowly, but the void-like orb remains suspended, utterly still, as though anchored by something beyond understanding.\n\nHours later, the area is secured by the National Guard, and government officials set up an outpost under white canvas tents. Traffic is rerouted in both directions. Representatives from DARPA, NASA, the FBI, and the NSA gather to study the phenomenon. Speculation flies: “Is it alien technology? A new form of undetectable weapon? How is this scientifically possible?” Before them, the black sphere hangs—a perfect void, unmovable, lightless, a tear in reality itself. It’s not just black; it’s an absence, as if the universe has been punched out at this precise point in space. They test its limits, throwing weight, force, and instruments at it, but the shadow orb refuses to budge. A NASA representative notes that the void is locked in place, bound to the Earth’s rotation. Yet their instruments reveal nothing—no origin, no explanation.\n\nAcross the world in Japan, a young girl walks down the hallway with her classmate, heading to their next class. Mid-conversation, the classmate drops her textbooks, clutching her head and screaming in agony. Her nails dig into her forehead as she frantically claws at it. The friend shouts for help. A teacher rushes over and tries to assist, but as they move the girl, her eyes roll back, and her body goes limp—suspended in midair by the top of her head. Japanese officials arrive, closing off the hallway. They find the girl’s body can’t be moved, though it can be rotated around a pivot point inside her skull. An impromptu autopsy begins in hopes of freeing the corpse. When they open her skull and lower her body, a floating ball of blood emerges, and as it drips away, a pitch-black void, an inch in diameter, is left lodged in place.\n\nAs the hours tick by, reports flood in from across the globe. More spheres appear, locked in place, immovable. Planes tear apart mid-flight, ships vanish beneath the sea, and entire cities fall into a deathly silence, all under the growing shadow of the voids. Governments and media urge people to stay still if they feel any sudden pain. Within six hours of the first appearance in Oregon, the entire planet is riddled with these dots, each spaced exactly two feet apart in a perfect grid. Those unfortunate enough to have a dot appear in vital parts of their bodies—heart, brain—are immediately killed, their corpses suspended in place by the void. The world holds its breath, expecting something worse to come.\n\nBut twelve hours after the first dot appeared, they begin to shrink and vanish without a trace. The dead drop to the ground, finally free. The survivors, dazed and wounded, begin to take stock of the damage. No one knows where the dots came from. No one knows why they appeared. And no one knows why they disappeared. As the world slowly returns to a fragile normal, one question lingers in every whispered conversation: What if the dots were just a warning, a glimpse into a reality we were never meant to see—or escape?\n\n ",
        "Tom’s cabin sat deep in the woods, surrounded by endless trees and untouched wilderness. For three years, it had been his escape from the world, a place where he could find peace. It was just him and Max, his loyal German Shepherd, tucked away from everything.\n\nLately, though, something felt off.\n\nIt had started small—an unsettling quiet that lingered longer than usual, a stillness in the air that made Tom’s skin prickle. And Max, always sharp and alert, seemed on edge. He’d pace at night, sometimes growling softly at the dark windows, as if sensing something Tom couldn’t see.\n\nTom tried to shrug it off. Animals, maybe. Wolves or coyotes moving through the woods. Max had always been protective, always quick to pick up on sounds that Tom missed.\n\nBut tonight, the unease was worse.\n\nThe cabin felt colder than usual. The fire crackled weakly, casting flickering shadows on the walls. Max lay by the door, resting his head on his paws. He seemed calm, but his ears twitched every now and then, like he was listening for something.\n\nTom stood by the window, staring out into the night. The forest beyond the cabin was pitch-black, the trees swaying gently in the wind. It was quiet. Too quiet. The kind of silence that made the hairs on the back of your neck stand up.\n\nMax raised his head, his ears pricking up. Tom glanced at him, his stomach tightening. “You hear something, boy?”\n\nMax didn’t move, but his eyes were focused on the door now, his body tense. Tom’s pulse quickened. He moved to the door, checking the lock. Everything seemed fine, but the feeling of being watched was hard to shake.\n\nThen came the knock.\n\nIt was soft at first, almost like a tree branch tapping against the wood. Tom froze. There was no one out here—no one for miles. The nearest town was a good three-hour drive, and no one ever came this deep into the woods.\n\nMax stood up, a low growl rumbling in his chest.\n\nThe knock came again, louder this time.\n\nTom grabbed the shotgun from its place by the door. His heart pounded in his chest as he called out, “Who’s there?”\n\nSilence.\n\nMax’s growl deepened, and he moved closer to the door, his body coiled like a spring. Tom swallowed hard, his palms slick with sweat. He cracked the door open just enough to peek outside.\n\nNothing. Just the empty woods, the darkness thick and oppressive.\n\nThen, there was a sound.\n\nAt first, Tom thought it was just the wind—something whispering through the trees—but then he heard it again, closer this time. A low, guttural noise, like something trying to speak but struggling to form the words. The knocking resumed, but it was uneven now, as if whatever was outside had grown impatient.\n\nAnd then, through the thin wooden door, Tom heard it.\n\n“M-mmm…aaa…axx…”\n\nIt was his own voice, distorted and slurred, like a broken recording. The thing outside was trying to mimic him—trying to say his dog’s name.\n\nTom’s blood ran cold. His grip tightened on the shotgun, his pulse hammering in his ears. He stepped back from the door, keeping his eyes on it, every instinct in him screaming to stay away.\n\nThe voice came again, closer now, and the knocking grew louder, more erratic.\n\n“Let… me… i-in…”\n\nTom staggered back, his breath coming in shallow bursts. Max’s growl had deepened to a snarl, but he didn’t bark or lunge at the door like he normally would. Instead, he stood rigid, watching the door with an intensity that unnerved Tom.\n\nThe voice outside shifted, warping, sounding less human with each word.\n\n“Maaaax… good… boy…”\n\nTom’s heart leapt into his throat. It was like hearing someone rehearse human speech, failing horribly at it. The way it said Max’s name—too slow, too strained—it sent a wave of nausea through him.\n\nWithout warning, Max bolted out the door, barking wildly as he disappeared into the night.\n\n“Max! Max, get back here!” Tom shouted, his voice echoing through the trees.\n\nHe cursed under his breath and hurried after him, shotgun in hand. The woods were eerily quiet, save for Max’s distant barking, which grew more frantic by the second.\n\nTom’s boots crunched through the underbrush, his breath visible in the cold air. Max’s barking sounded strange now—too repetitive, almost like an echo that didn’t match the dog’s usual rhythm. It was unnerving, but Tom pressed on, calling Max’s name as he followed the noise deeper into the forest.\n\nThe further he went, the more disoriented he felt. The trees seemed to close in around him, the night growing colder and darker. Max’s barking was growing faint, coming from farther ahead. Then, just as suddenly as it had started, the barking stopped.\n\nTom froze.\n\nThe silence was suffocating.\n\nHe reached a small clearing and saw Max standing at the far edge, just at the tree line. The dog’s back was to him, his head lowered as he stared into the woods.\n\n“Max?” Tom called softly.\n\nMax didn’t respond. He didn’t even turn to look at him, just stood perfectly still, his body tense.\n\nTom’s heart raced as he approached. “Come on, boy, let’s go back.”\n\nMax remained frozen, his ears flicking slightly at Tom’s voice. Tom moved closer, his grip tightening on the shotgun. The forest felt wrong—like it was holding its breath, waiting.\n\nThen, just beyond the tree line, there was movement.\n\nTom couldn’t see it clearly—just a shadow, barely visible through the branches. It shifted, too quick to make out, but it was tall, disturbingly tall. The air grew colder, the kind of cold that gnawed at your bones.\n\nTom’s gut clenched with fear. He took a step back, eyes darting between Max and the dark woods. “Max, come on,” he urged, trying to keep his voice steady.\n\nMax finally moved, turning his head slowly to look at Tom. His eyes caught the moonlight for a moment—too bright, too reflective. But it was quick, almost imperceptible. He looked normal, mostly.\n\nTom exhaled, shaking off the creeping dread, and Max followed him back toward the cabin. The dog walked close, his movements seeming normal enough, if a little quiet, a little too steady. But Tom didn’t dwell on it. He was too focused on the feeling that something was still out there, watching them.\n\nBack inside, the cabin felt warmer, but the tension hadn’t left. Tom sat by the fire, rubbing his temples. Max lay in his usual spot by the door, his eyes open, watching the room.\n\nThe strange knock, the shadow in the woods—it all gnawed at Tom’s nerves. He tried to convince himself it was nothing, just the isolation getting to him, but it didn’t help. The silence weighed heavy, and Max seemed unusually still. But after the night’s chaos, it was almost a relief that he’d calmed down.\n\n“Good boy,” Tom muttered, half to reassure himself as much as Max.\n\nMax’s ears twitched slightly at the words, but he remained still, his gaze lingering on the fire. Tom chalked it up to exhaustion and finally drifted into an uneasy sleep.\n\nIn the dead of night, Tom woke with a start. The fire had burned down to embers, casting weak shadows across the room. He sat up, disoriented, his heart racing.\n\nMax was sitting at the foot of the bed.\n\nThe dog’s eyes locked on Tom. His head was cocked slightly to the side, and his expression was unreadable, too blank.\n\nTom rubbed his eyes, trying to shake the drowsiness. “Max?”\n\nMax didn’t respond. He just watched.\n\nA chill ran down Tom’s spine. The way Max was sitting—it wasn’t right. Too stiff, too deliberate. His mouth twitched slightly, as if he was mimicking a smile, but it was wrong. It looked more like a grimace, a hollow imitation.\n\nTom’s breath hitched. He swung his legs off the bed, unease spreading through his body. Max’s head tilted further, just a fraction too much, and Tom’s stomach dropped. Something about his eyes—something dark and unfamiliar flashed there, just for a second, before fading.\n\nThe silence stretched between them. And then, Max’s mouth opened, his voice low, unnatural, and yet horribly familiar.\n\n“Good boy.”\n\nTom’s blood turned to ice.\n\nIt was his own voice.",
        "The village of Eldridge had an unsettling charm; twilight darkened the shadows along the cobblestone streets. Crickets sang their night song, yet the whispers among terrified townsfolk drowned out the night's melodies.\n\nMike sat watching them perched in his attic, dressed in a fraying hoodie and pajama pants. The dim glow of his computer cast light on the ceiling, illuminating tacked-up notes, photographs, and scraps of red string connecting each villager’s mundane actions. \n\nThe other gamblers in his group were lighting up the forum with their own prediction on how the residents of Eldridge would behave tonight during the autumn equinox ceremony. Mike sipped his Sarsaparilla Appleton, eyes gleaming with anticipation. He was an astute observer of human oddities.\n\nAs the clock neared midnight, Mike's screen flickered with activity. Townsfolk, lit by flickering lanterns, gathered around a blazing bonfire in the village square. Crumpled letters, inked with desperate confessions and hidden grievances, were tossed into the flames, curling upward like souls yearning for release.\n\nEach year, the villagers would write down their grievances—confronting their own faillures and the fails they did to other.  Thus tonight's activities were important because they allowed them to grieve together. This particular year, however, the villagers whispered of something making everything dangerous: the blood moon.  The last blood moon had turned up many unexpected occurances.  Mike’s heart raced, the thrill of potential disaster electrifying his senses. He placed his bet.\n\nA message pinged into the chat. \"Someone's gonna unleash a big win tonight. Bet on it.\"\n\nThe whole online forum echoed this sentiment, giving the night a buzzing undercurrent of intensity. The villagers of Eldridge unwittingly were part of on of the largest underground betting rings on Earth.  Mike had felt intrigued as soon as he learned that people were betting on GHOST released by this village.   Mike had scrolled through photos of the townsfolk, feeling he had a special knack for predicting human behaviors so he was sure to win with GHOSTBETTERS.  \n\nStudying each of their hands as they fed letters into the flames. He typed furiously, weaving bits of speculation, analyzing each villagers' expressions. A flood of guesses rippled through the group.\n\nSuddenly, a sickening hush fell over the chat. A new video popped up on Mike’s screen—streamed live from a villager’s shaky camera, showing the crowd standing breathless before the fire. He watched, enraptured, as the villagers began chanting softly. Something ignited within him, a mix of trepidation and thrill.\n\nThe SMOKE was the BIG MONEY BET.  The villagers themselves held the smoke as sacred, believing it told them what the ancestors' saw in them.  The pAranormAl Society had created digital overlays that allowed them to record the biometrics of the smoke and keeping a tally of each villagers reactions to the smoke visions.\n\nWith the first clang of midnight, flames surged, and the smoke twisted grotesquely, forming faces. Mike watched as the villagers stumbled back in horror—mouths agape, eyes bulging.  Even Mike could clearly see the figures that began to emerge from the flickering flames.  They were thin translucent white silhouettes and the pAranormAl Society's camera was scanning them for unique biomarkers. \n\n*Question for Audience:  Would you be willing to be paid a payout for allowing people to make bets on your behaviors?*\n\nMike's fingers danced over the keyboard. The  entire GHOST biometrics were in - he was the night's big winner!  But something itched at him, a gnawing guilt as the chat turned frantic, questions piling, fingers pointing, blaming each other.\n\n*Question for Audience:  Would you be mad if you found out that you behavior was being bet on by an online community that was measuring your behaviors and betting on it without giving you any of the proceeds?*  \n\nCould it be that all the villagers' whispers of being watched, pointed to that someone had let the Eldridges know that pAranormAl Society's GHOSTBETTERS were being watched.  \n\nHad Mike informed them? Had their cupped hands and little whispers been Mike's informant telling them how to behave for the night?   \n\nSuddenly a villager turned to the camera and said, “Who did you kill, Mike?  The ghost have told us you killed someone.”\n\nMike gulped and turned off the computer.  He didn't have to put up with any questions.  But the unease grew in his mind so he turned on his phone.  \n\nThe villager was still waiting on him.  \"Our Ancestor's told us you have helped us understand we are being watched but they said you promised to offer up the sacrafice they want.  And they want you to confess you killed someone once,\" the villager said with all of Eldridge waiting on his reply.\n\nMike was helpless. His previous thrills all morphed into dread.  Each secret killing Mike had encased in letters burned behind his bed frame and he thought them over. Mike watched them silently, reluctant to answer them, entranced and paralyzed; their eyes were not settled on seeking solace this year from the spirits but rather on him, the unseen voyeur watching from the dark, hidden behind the digital wall.\n\n“No,” Mike muttered. “Not me.” But the villagers’ gaze only sharpened, as if they brandished a sharpened knife of collective blame. \n\n\"No, you know how many burnt letters you have on your bed.  The Ancestor's told us, Mike. You promised to sacrifice what they want if you won.\"  \n\nThe screen flickered. No longer was he an observer; he was being accused, judged by the haunted figures he watched through the screen. The weight of his sins dragged him into their world—a world where innocence reigned and magic still dwelled.\n\nThey had felt the worlds intrusions, the online whispers, and now the very spirits they unleased sought to answers from Mike. Their moans lingered in the air, beckoning Mike to join them. He screamed, but the sound barely broke the silence of the attic, the smoke shroud specters weaving closer around him.\n\nHe was no longer simply betting on GHOST; he was the next chapter of Eldridge’s tragic tale—a spectator unwittingly entwined in the balance of life and death under the blood moon's haunting glow. \n\nFor MIke death was the result of the blood moon.  The autopsy ruled it an unknown death. ",
        "I had a boyfriend from Switzerland. We met at a conference for forestry services in the Alps, then he moved here to live with me in Bishopville, South Carolina.  I got him on at forest services at our local state park.  We shared a cabin together in the forest.  Everything was going great.  \n\nOne night I really loved a shirt he was wearing. I noticed it was an artistic design that someone had screenprinted so I asked him who made it for him.  He said, \"oh this...this is Stollwurm. My ex-girlfriend was an artist.  She made it.\"\n\nI paused because he'd told me he never had a gf before me.  So I asked him how that was so, but he just explained it was never made official and that they just liked making art together.  \n\n\"What's a Stollwurm,\" I asked looking over the design on his shirt, realizing it was some sort of Lizard creature but before he could answer I said, \"that's very weird that you were making lizard art with your friend and our town is known for the Lizard Man of Scape Ore Swamp.\"  \n\nI couldn't let it go.  I found out that they had kept their connection. I found out one night when he left his phone out and I saw her Instagram, or i should say THEIR shared instagram.  I found out that they were making art together online.  And that the things he was making in our workshop were going on their Instagram.  \n\nOne night after I went to bed, I realized he slipped out of to go talk to her in the backyard close by where the swamp edged into our yard. I watched out the window as he paced back and forth.  I couldn't resist to ask what was going on when he came back in. \n\nShe had a dream of him getting run over by a lizard creature. \n\nWe both laughed and agreed that her screenprinting was getting the better of her, but then we had a discussion about if there was something between them that I needed to know.  He assured me there wasn't so we went to bed.  \n\nWe did not think anything about it until a few weeks later we'd gone bowling on a Sunday afternoon and on the way home there was a parade for the Lizard Man.  It had us held up as traffic was being diverted. While we were stuck in line in traffic, saying how it's nice they still make floats, we both suddenly noticed that it would be easier to take the old swamp road home. \n\nAs we headed down the gravel road we must have hit a sharp stone because we popped a tire. Together we had got the jack and changed it in no time.  Right after I threw the jack in the trunk I looked up to see a green, wetlike creature crawl out of the swamp on all fours. It about 7 feet (2.1 m) tall.  I grabbed my boyfriend and we ran into the car, locking it as fast as we could. \n\n First was saw its three fingers climbing over the front dash, staring at us with it's red eyes.  We could see the pale underside scales smooshing on the glass.  We'd both accidently left our phones on the trunk so we coudln't get a good photo.\n\nWe decided it was best to forget the phones and we wanted to get the lizard creature off the roof.  So we sped off but it clung to the roof.  He was trying to watch for it to fall off but never did we feel it so I slammed on the brakes as hard as I could.\n\nThe creature rolled off the car. It grasp it's knees like they hurt from the fall.  We left our phones behind and went to talk to the Sheriff's office and the Department of Natural Resources.  But the DNR wasn't open and the Sheriff's office treated us like we were just having some mental issues and maybe it was time to talk to a therapist.  \n\nWe decided to go back to where our phones were and they were still laying in the gravel.  We saw no signs of the Lizard Creature and in face we decided there was no such thing.  That we had just got carried away worried about his friend's dream.  ",
        "\\[[Master link to other parts, as they become available in series section](https://linktr.ee/LCDatkin)\\]\n\n\n\nThe weekend came and went in a blur of sleepless nights and mounting paranoia. My brother had taken it upon himself to stay with our dad, watching over him as he grieved for Mom. I knew Dad needed him, needed that comfort, but I couldn’t bring myself to leave my house. The fear that had taken root in me after Mom’s death had only grown. I was too scared to step outside, too terrified of what—or who—might be waiting for me.\n\n\n\nI spent my days pacing, peeking out the windows over and over, scanning the street for anything out of place. The slightest noise—a creak in the floorboards, the wind against the window—would send my heart racing, pushing me into a spiral of panic. Sleep was a distant memory now, and every time I closed my eyes, I felt like something—someone—was watching me, waiting for the moment I let my guard down.\n\n\n\nI couldn’t go back to work. I had turned in all of my PTO the day before I was due to return, knowing there was no way I could focus on anything beyond the constant fear gnawing at me. I was trapped in my own mind, and leaving the house felt like it would open the door to whatever nightmare was coming next.\n\n\n\nI didn’t own any firearms, but I had knives. Not many, but enough to make me feel a little more secure. I kept one on me at all times, and the rest I’d stashed around the house, hidden in places I could reach if Roger—or whoever was behind this—tried to break in. The thought of him, of the threat I’d received, was always there, like a shadow lurking in every corner of my mind.\n\n\n\nThe sleep deprivation was getting worse. I had only managed a few hours of restless sleep over the course of several days, and my nerves were frayed. Every noise felt like a warning, every shadow a threat. I was constantly on edge, jumping at every creak and groan of the house.\n\n\n\nI knew I was spiraling, but I didn’t know how to stop it.\n\n\n\nBy Wednesday, the days had started to blur together, each one dragging on in a haze of fear and exhaustion. My mother's funeral was tomorrow, but the thought of leaving the house terrified me. My brother and dad had been calling and texting me constantly. They wanted to make sure I was okay, but I couldn’t let myself stay on the line for long. What if my phone was bugged? What if *they* were listening, tracking my every move? I would answer, reassure them with a few short words, then quickly hang up before the panic set in.\n\n\n\nMy father had called again earlier, his voice gentle but pleading. He told me that he understood how I felt—how terrified I must be—but that I couldn’t let this fear consume me. \"You have to come to your mother’s funeral,\" he said, his voice cracking. \"We need you there. I need you there. You can’t live like this forever.\"\n\n\n\nBut to me, it felt like he just didn’t get it. Sure, he had lost Mom, but his life hadn’t been directly threatened. He wasn’t the one receiving those emails, those cryptic warnings. Roger had killed Patricia, I was sure of it. He’d killed Mom too, and now, it was only a matter of time before he came for me. My father's take felt naive, almost dangerous. He thought we could move on, but I knew better. There was no moving on when you were next on the list.\n\n\n\nI hadn’t received any more emails from Roger since the last one, but that only made me more paranoid. They were probably waiting for me to make a move, waiting for me to leave the house, to give them an opportunity. For all I knew, they’d already sabotaged my car, just like they had with Patricia’s. One wrong turn, one flick of the ignition, and it could all be over.\n\n\n\nI couldn’t even bring myself to order food anymore. After what happened to Mom, the thought of trusting anyone—even a delivery driver—sent waves of anxiety through me. I had been surviving off the old canned food in my pantry, the stuff I’d forgotten about for years. The taste didn’t matter anymore. I just needed to stay alive, to stay hidden.\n\n\n\nBut tomorrow was the funeral. I knew I should go, but I couldn’t shake the feeling that it would be the perfect trap. It would be the first time I’d left the house in days, and Roger—or whoever was behind this—was probably counting on that.\n\n\n\nMom’s funeral came and went without me. I couldn't bring myself to leave the house, and as expected, my father and brother were furious. They showed up at my door the day of the funeral, their faces drawn with grief and frustration, practically begging me to come with them. But I couldn’t. I stood there, my hands shaking as I told them that if I left, I would be the next one to go into a coffin. The words felt like knives, cutting through the air between us, but it was the only way I knew how to make them understand. \n\n\n\nThey didn’t force the issue after that. I think they realized just how far gone I was, how deep my fear had taken root. A few days later, they came back, this time with groceries—basic stuff like milk, bread, eggs, even a few frozen meals. They were trying to help, but I couldn’t trust it. I couldn’t trust anything that didn’t come directly from my own hands. So, I threw it all out. Everything except the canned food. It was the only thing I felt safe eating, the only thing that hadn’t been touched by anyone else. \n\n\n\nFor a while, the police had patrol cars set up in my neighborhood, watching the house, driving by every few hours. It gave me a shred of comfort, knowing they were out there, but even that was temporary. After the first month, they decided that everything had “cooled down,” as they put it. They believed whoever had been behind the emails and the threats was long gone by now. They told me that whoever it was had likely moved on.\n\n\n\nThe police had managed to trace the emails back to a series of hotels in the area. Each set of emails had been sent from prepaid mobile phones, disposable burners that were found smashed in dumpsters nearby. They tried to reassure me, saying that they were still monitoring the situation and that they hadn’t completely dropped the case, but it didn’t help. I hadn’t felt safe in months, and their vague promises didn’t change that.\n\n\n\nEven with their so-called “eye on the area,” I still felt as vulnerable as ever. Every creak in the floorboards, every gust of wind against the windows, every unfamiliar car that passed by sent me into a spiral of panic. My nerves were shot, and sleep was a distant memory. I was living in a constant state of paranoid frenzy, waiting for the next shoe to drop, for the next message to come through, or worse—for Roger, or whoever this was, to finally make their move.\n\n\n\nI knew the police didn’t think anything else was going to happen. I could hear it in their voices, the way they talked to me like I was being paranoid, like I was seeing threats where there were none. But they weren’t the ones being hunted. They hadn’t lost Mom. They hadn’t been receiving those messages, waiting for the inevitable. They didn’t know what it was like to live in this constant state of fear, to feel like any moment could be your last.\n\n\n\nSo, here I was—trapped in my own home, surrounded by canned food and knives hidden in every corner, waiting. Just waiting for whatever was coming next.\n\n\n\nBy this point, I had lost my job. The PTO ran out, and after missing weeks without a word, they finally let me go. It wasn’t like I could have gone back anyway. My savings were dwindling, slipping away with each passing month, and I couldn’t bring myself to care. It didn’t matter how much money I had—none of it could protect me from what I knew was coming.\n\n\n\nMy brother had stepped in to help. He came by every week, bringing canned food and supplies, doing his best to support me. He even helped with rent and utilities, making sure I wouldn’t lose the house on top of everything else. I think he knew I was barely holding on. Every time he came over, he’d try to talk to me, gently telling me how much Mom’s death had hurt all of us, how the family was worried about me. How I wasn’t the only one suffering.\n\n\n\nBut he didn’t understand. No one did. \n\n\n\nI kept trying to explain it to him, trying to make him see why I was doing what I was doing. “This isn’t just about me,” I told him one day as we sat in my living room, the blinds drawn tight like always. “He said I was next. Which means that he won’t hurt anyone else until I’m dead.”\n\n\n\nMy brother didn’t say anything for a long time, just stared at me with that same worried look he always had. I could tell he was trying to reason with me, trying to pull me back to reality. But to me, this *was* reality. “Staying here,” I continued, “keeping myself trapped between these four walls—it’s not just keeping me safe. It’s keeping everyone safe. Dad. You. All of us.”\n\n\n\nHe shook his head, his voice soft but insistent. “You don’t know that for sure. You can’t just keep living like this. This isn’t living, it’s—”\n\n\n\nI cut him off. “I *know* it. As long as I stay in here, he can’t get to me. He can’t get to anyone else.” My voice was shaky, but firm. I believed it with every part of me. Roger—or whoever this was—had said I was next. That meant it was me or no one. As long as I stayed hidden, as long as I kept myself alive, no one else would have to die.\n\n\n\nHe sighed, rubbing the back of his neck like he always did when he was frustrated. “I get it. I do. You’re trying to protect us. But this isn’t sustainable. You’re not eating right, you’re not sleeping, and you’re—”\n\n\n\n“I’m keeping you *safe*,” I snapped, louder than I meant to. “That’s what matters.”\n\n\n\nHe looked at me, sadness in his eyes, but he didn’t argue anymore. He just nodded, dropping the conversation for the moment. But I could tell he was worried. Maybe he was right, maybe I wasn’t living anymore. But what choice did I have? I had to do what was necessary to survive, to keep everyone else out of danger.\n\n\n\nAs long as I stayed in this house, trapped between these walls, I was keeping him and everyone else safe. And that’s all that mattered.\n\n\n\nFall had arrived, the air turning crisp as the leaves began to fall, swirling in small clusters outside my window. The change in the season didn’t bring any comfort, though. My savings were practically gone, the last bits of money dribbling out for rent, utilities, and whatever other small expenses I couldn’t ignore. The walls of my house, which once felt like protection, were now starting to feel like a cage. \n\n\n\nMy brother came over one afternoon, his face serious. I knew something was coming, but I wasn’t prepared for the ultimatum he gave me.\n\n\n\n“Look,” he said, standing in the doorway, his arms crossed. “I can’t keep doing this. I can’t keep bringing you food and covering your bills. It’s not just about the money. You can’t live like this anymore. You need to come out of this house, and you need help. I’m telling you—either you move in with us, stay with my family until you can get over this fear, or I stop bringing you food. I can’t watch you do this to yourself anymore.”\n\n\n\nI stared at him, my heart pounding in my chest. The walls around me suddenly felt even tighter, pressing in on all sides. I wasn’t ready to leave the house. I wasn’t ready to face whatever was waiting for me out there. “Please,” I said, my voice breaking. “I just need a little more time. Just give me another week. I can’t leave yet, but I will. I will, I promise.”\n\n\n\nHe shook his head, his expression unwavering. “No more time. I’m serious. You have to make a decision now. You come with me, or I stop bringing the food. It’s time to face this. You can’t keep hiding here forever.”\n\n\n\nDesperation clawed at my insides. “Next week,” I pleaded. “I just need a little more time to get my things together. I’ll be ready next week. I’ll come to your house, I swear. I just—just a little more time.”\n\n\n\nMy brother sighed heavily, clearly torn between his concern and frustration. After a long pause, he nodded. “Alright,” he said, finally relenting. “One more week. But that’s it. After that, you’re coming with me, or you’re on your own.”\n\n\n\nI nodded quickly, relieved that he was giving me the time I’d begged for. “Thank you,” I whispered, stepping forward. He looked at me with a mix of sadness and hope, and before he turned to leave, we shared a hug at the doorstep. It was a hug that felt final somehow, as if the safety I’d clung to inside these walls was slipping away, and soon, I’d have no choice but to face what I feared most.\n\n\n\nAs I watched him walk back to his car, I knew I couldn’t delay any longer. Next week, I’d have to leave this house. But deep down, the fear still lingered. I couldn’t shake the feeling that the moment I stepped outside, *he* would be waiting for me.\n\n\n\nI started packing my things, my hands shaking with each item I stuffed into my bag. Laptop, chargers, clothes, toiletries, the basic necessities. But as I zipped up my suitcase, the weight of my decision settled on me like a ton of bricks. I was terrified—*Roger* had made me this way. My mind raced with a whirlwind of fear and self-loathing. How had it gotten this far? How had I let him do this to me?\n\n\n\nI cursed myself for being so weak, for allowing my life to unravel because of one man. He had already taken Patricia’s life, and then he took my mother’s. And now, in a different way, he had taken mine too. I wasn’t living anymore, not really. I was just existing—trapped in this house, locked away from the world because of the fear he planted inside me. I had become a prisoner to that fear, voluntarily locking myself in this cage, terrified of what might happen if I stepped outside.\n\n\n\nEverything felt like a trap now. The cars on the road that passed by too slowly, as if they were watching me. The food from the grocery store, which I could no longer trust. Even the man who jogged in front of my house every morning felt like a potential threat, a signal that Roger—or whoever it was—had eyes everywhere. I couldn’t shake the feeling that I was being watched at every moment, no matter what I did or where I went.\n\n\n\nWas this really how I was supposed to live? Constantly waiting for the next attack, the next moment where everything crumbled again? Would I be running forever, hiding from a shadow that may or may not even be lurking? \n\n\n\nI closed my eyes, forcing myself to breathe, and tried to calm the storm of thoughts swirling in my head. I couldn’t live like this any longer. If I continued down this path, I might as well be dead already. Roger hadn’t just taken the people I loved—he had taken my sanity, my freedom. But I was done giving him that control. \n\n\n\nI had promised my brother that I would go to his house. And despite the gnawing terror in my gut, I was going to make good on that promise. I wasn’t sure if I could handle leaving the safety of these four walls, but I knew one thing for certain: I couldn’t stay here and wait for the fear to consume me.\n\n\n\nI spent the next hour cleaning up my house, locking every window, every door, hoping there might come a day when I could return and live a normal life again. Part of me doubted it, though. The life I had before all this—the life where I didn’t constantly look over my shoulder—felt impossibly distant. Still, I wanted to believe there was a chance, no matter how small, that I could come back and feel safe here.\n\n\n\nAfter everything was secured, I sat on the front steps of my house, the cool evening air brushing against my face. I watched as cars drove by, their headlights flickering against the darkening sky. People passed on their evening walks, talking softly, lost in their own worlds. To them, this was just another normal night. But to me, every person who passed was a potential threat. My hand remained wrapped around the knife in my pocket, my grip tight. I couldn’t shake the fear that any one of them could be *him*—Roger, or whoever this faceless figure truly was.\n\n\n\nI had no idea if \"Roger\" was even the person’s real name. It could all be part of the game they were playing. Whoever it was, they were out there, watching, waiting for the perfect moment. I sat there, frozen, every muscle tense, prepared for someone to step out of the shadows.\n\n\n\nHeadlights appeared down the street, casting long shadows across the sidewalk. My heart raced as the car slowed in front of my house. For a split second, I gripped the knife even tighter, ready to defend myself, my mind jumping to the worst-case scenario.\n\n\n\nBut then I recognized the car. It was my brother.\n\n\n\nI exhaled, relief washing over me as I stood up. My brother pulled into the driveway, parking by the curb. I greeted him with a strained smile and moved to load my luggage into the trunk. I still felt on edge, but I tried to push it aside for now. This was the plan—leave the house, go with him, and try to start over. But as I approached the passenger door, I couldn’t help the creeping paranoia. I had to be sure. \n\n\n\nBefore I got in, I leaned down and checked the backseat, my eyes scanning the shadows, my breath caught in my throat. I was half-expecting to see *him*—Roger, or whoever this person was—hiding there, ready to spring out at us. But the backseat was empty.\n\n\n\nI let out another shaky breath and opened the passenger door. I slid into the seat, trying to calm the racing thoughts in my mind. It was just me and my brother. We were safe—for now.\n\n\n\n\"Ready?\" he asked, glancing at me with a worried smile.\n\n\n\nI nodded, gripping the handle of the knife still tucked into my pocket, just in case.\n\n\n\nMy brother could sense how tense I was the moment we pulled away from my house. Every muscle in my body was stiff, my eyes darting nervously between the cars passing us by. He tried to ease the tension with some small talk, talking about work, about his kids, about how nice it would be to have me at their place for a while. I nodded along, playing the part, pretending I was ready to get past all of this hesitation and fear, that maybe with a little bit of help, I could go back to something resembling a normal life.\n\n\n\nBut deep down, I was fighting the urge to tell him to turn the car around, to go back to the only place that still felt safe—my house. Every pore in my body was screaming at me to run back, lock the door, and never leave again. The familiar panic crept in, and I couldn’t shake the thought that one of these passing cars might swerve into us, that *he* was out there, waiting for the perfect moment.\n\n\n\nMy brother must have noticed me glancing nervously out the window. He reached over, giving my arm a reassuring pat, his voice calm and steady. \"I know this is hard,\" he said. \"But things have settled down, at least a little, since Mom... passed. It's just a new kind of normal now. We’ll get through this.\"\n\n\n\nThat word—*passed*—hit me like a punch to the gut. Without thinking, I turned to him, my voice rising before I could stop myself. “She didn’t *pass* away!” I yelled, my throat tight with anger and grief. “She was *murdered* in front of me! You can’t just act like this is something we move on from.”\n\n\n\nMy brother sighed heavily, the weight of the conversation pulling him down. He gripped the steering wheel tighter but didn’t snap back. He was patient, trying to understand. “I know, okay? I know it was terrible. What happened to Mom… it was awful. I loved her too, just as much as you did.”\n\n\n\nI stared out the window, the trees and streetlights blurring by, my chest heaving. I wanted to scream at him more, to make him understand that this wasn’t something we could just brush aside, that this wasn’t just grief—it was fear, a terror that had dug its claws into me and wouldn’t let go. But before I could say anything else, he spoke again, softer this time. “We need to figure out a new normal, for both of us. And that means you coming back into the world.”\n\n\n\nHis words hung in the air. Part of me knew he was right, that I couldn’t keep hiding forever. But another part of me—the part that had been living in fear for months—was screaming that I wasn’t safe, that none of us were. \n\n\n\n“I’m just trying to help you get there,” he added gently.\n\n\n\nI didn’t respond right away, just gripped the knife in my pocket tighter and nodded. I wasn’t sure if I was ready to step back into the world, but I was here, for now. And that had to be enough.\n\n\n\nBefore I knew it, we were pulling into my brother's driveway. The familiar house stood in front of me, but before I could even take in the sight, my nephews burst out of the front door, running straight toward the car, their small fists banging on the windows. Their faces lit up with excitement when they saw me, and for the first time in what felt like forever, I smiled.\n\n\n\nI stepped out of the car, and they immediately tackled me in a flurry of hugs and shouts, their energy infectious. I ruffled their hair, laughing as I rubbed their big heads. I couldn’t help but grin at their enthusiasm. It was the first real moment of happiness I had felt in months, a brief glimpse of what life used to be like.\n\n\n\nMy brother caught my eye and gave me a knowing smile, and for the first time, I thought maybe—just maybe—this was the right step. Coming here, being with them, maybe it was the beginning of something normal again. Or at least the first step toward it.\n\n\n\nWe headed inside, and slowly, I started to let my guard down. The smell of my sister-in-law’s meatloaf filled the air, making my stomach growl despite the anxiety still lingering in the back of my mind. The kids ran around the house, shooting their toy guns at each other, laughing and shouting with that carefree energy only children have. The chaos of it all was overwhelming at first, but in a way, it was comforting too—a stark contrast to the deafening silence that had consumed my life over the past few months. \n\n\n\nIt was nice to have a little bit of chaos.\n\n\n\nDinner was exactly what I needed. We sat around the table, passing food back and forth, sharing stories and, for the first time in what felt like forever, laughing. The weight of the past months began to feel a little lighter, if only for a short time.\n\n\n\nMy nephews, always full of questions, looked up at me with wide eyes and asked, “Uncle, which dinosaur was the biggest and meanest?” Of course, they both had their answer ready—*Tyrannosaurus rex*, no question.\n\n\n\nI chuckled and shook my head. “You know, I think the *velociraptor* was scarier,” I said, leaning in as if sharing a secret. They looked at me with disbelief. “Because they were stealthy, quiet. They could get you whenever they wanted, and you wouldn’t even know. A *Tyrannosaurus rex*? You’d hear that coming from miles away.”\n\n\n\nThey erupted into laughter, firing back childish remarks, saying no way could anything be scarier than a *T. rex*.\n\n\n\nAs I chuckled, I glanced across the table at my brother. His expression had shifted, his eyes meeting mine with a look of understanding. He knew what I was really saying—that the silent, invisible threats were the ones that scared me most. That’s what Roger—or whoever he was—had become to me. A silent predator, always there, lurking, but never making enough noise to be caught.\n\n\n\nWe didn’t talk about it. There was no need to say it out loud. But the look in his eyes told me that he understood, and for a moment, that shared understanding made me feel a little less alone. \n\n\n\nWe went back to laughing, the tension fading away under the warm glow of the kitchen lights, surrounded by family, food, and the noisy chaos of a home full of life. For the first time in what felt like forever, I began to feel a tiny spark of hope. Maybe things could start to change. Maybe, just maybe, I could find my way back to some kind of normal.\n\n\n\nAfter dinner, we spent some time lounging in the living room, watching the kids play video games on the big TV. Their laughter and the occasional competitive shouts filled the room, while my brother and I made small talk. It felt good, in a way, to be in a house full of energy. But no matter how hard I tried to settle in, I couldn’t fully shake the tension that had been with me for so long. Every few minutes, I made some excuse to get up—using the bathroom, grabbing something from my bag—just so I could take a moment to peek out the window, scanning the quiet street outside.\n\n\n\nAt one point, while I was peeking out, checking to see if there were any cars lingering too long or anyone standing in the shadows, my brother tapped me on the shoulder. I jumped, my heart slamming in my chest, my hand instinctively reaching for the knife in my pocket. But when I turned, I realized it was just him. I exhaled, embarrassed.\n\n\n\n“Hey,” he said softly, giving me a reassuring look. “I thought I’d show you to the guest room. It’s getting late.”\n\n\n\nI nodded, grabbing my bag and following him upstairs. The hallway was warm and welcoming, filled with the little touches of family life—photos on the walls, the faint sound of the kids’ giggles drifting from their rooms. As we passed by their doors, I couldn’t help but smile at the taped-up drawings and school art projects covering the walls outside their rooms. It was such a stark contrast to the sterile, quiet environment I had grown used to in my own house.\n\n\n\nMy brother led me to a small room next to the kids’ bedrooms. It was simple but comfortable, with a twin bed neatly made, a desk and chair in the corner, a ceiling fan, and a wardrobe. The soft, neutral colors and the quiet hum of the ceiling fan made the space feel peaceful.\n\n\n\n“Thanks for this,” I said, setting my bag down on the desk. “I really needed this push. I don’t know if I would have come out of the house on my own.”\n\n\n\nMy brother smiled and clapped me gently on the shoulder. “You’re family. No need to thank me. I just want you to get better.”\n\n\n\nI nodded, feeling a bit of the weight lift off my shoulders. “I think I’m gonna turn in early, though. I could use the sleep.”\n\n\n\n“Of course,” he said, stepping back toward the door. “You deserve a good night’s rest. We’ll catch up more tomorrow.”\n\n\n\nWe headed back downstairs, and I said goodnight to the family, who warmly returned the gesture, the kids half-paying attention as they continued playing their games. I felt a genuine sense of warmth, something I hadn’t experienced in a long time.\n\n\n\nBack in the guest room, I slipped into bed, the soft mattress almost pulling me under instantly. For the first time in months, I felt safe. Safe enough to close my eyes and let sleep take me.\n\n\n\nAnd it didn’t take long—I fell asleep almost as soon as my head hit the pillow, the comforting sounds of my brother’s family in the background lulling me into a peaceful, deep slumber.\n\n\n\nI had been enjoying what felt like the first truly peaceful, dreamless sleep I’d had in months, sinking deeper and deeper into oblivion, when the blaring sound of a fire alarm ripped me violently awake. I shot out of bed, disoriented, my heart pounding in my chest as the acrid stench of smoke filled the air. My throat immediately started to burn, and I was coughing before I even knew what was happening.\n\n\n\nPanic surged through me, and my first thought—*Roger*. I had escaped the safety of my own home, let my guard down, and now he was going to kill me and my brother’s entire family in one fell swoop. The nightmare I had feared for months had found me, just like I knew it would.\n\n\n\nWithout thinking, I darted for the bedroom door. The smoke made it hard to see, but I could hear the crackling roar of flames somewhere beyond the walls. I grabbed the door handle and yanked it open, but as soon as the door cracked, a fierce backdraft exploded in my face. The force of it sent me flying backward, my body slamming into the back wall of the bedroom. The wardrobe behind me splintered under the impact, shards of wood crashing down around me as I struggled to regain my breath.\n\n\n\nThe hallway outside was an inferno. Flames roared up and down the corridor, licking at the walls and ceiling, swallowing everything in its path. My mind raced—my nephews. My brother’s family. I had to help them. I had to get to them, but the hallway was impassable, a tunnel of fire. There was nothing I could do from here. The smoke was already suffocating, my lungs burning with each breath. I had to get outside before I was trapped in here for good.\n\n\n\nScrambling to my feet, I grabbed a chunk of broken wood from the destroyed wardrobe and rushed to the window. I swung the wood as hard as I could, shattering the glass, and immediately ducked as another backdraft burst through, this time shooting flames outward. The fire screamed as it sucked the air from the room, a scorching wind that singed my skin, leaving me with burns that sent waves of agony through my body. I could barely see, barely think.\n\n\n\nThe heat was unbearable. The walls felt like they were closing in, the fire consuming everything around me. My skin felt like it was being peeled away by the searing flames. I had to get out. \n\n\n\nWhen the flames receded from the window for a brief moment, I knew it was now or never. I took a leap of faith, my body hurling through the shattered window, falling two stories down toward the hard ground below. I hit the earth with a sickening thud, trying to roll as I landed. Pain shot through my body, my legs and arms burning with agony, but I was alive. I had made it outside.\n\n\n\nI hit the back deck hard, my body wracked with pain. Burns seared across my skin, shards of glass stuck in my arms and legs. I groaned, unable to move for a moment, my mind struggling to catch up with the agony coursing through me. The fire roared behind me, casting an orange glow across the night, and the smell of smoke filled my lungs.\n\n\n\nSuddenly, I felt hands on my back, rough and callous, flipping me over with a force that sent another wave of pain shooting through my body. I gasped, blinking through the haze of smoke, trying to focus on the figure above me.\n\n\n\nA man stood over me, bald, his face twisted into a cruel scowl. There was a large scar across his brow, cutting through his expression like a permanent reminder of something dark. But it wasn’t the scar that caught my attention. It was his eyes. Familiar, piercing, the same eyes I had seen every day of my childhood—the same eyes my mother had.\n\n\n\nThis was Roger.\n\n\n\nBefore I could even process what was happening, he grabbed me by the shoulders and began dragging me across the deck, toward the sliding glass door that led back inside the house. I could feel the heat from the fire even more intensely as he pulled me closer to the kitchen, where the inferno raged. My heart raced. He wanted me to die in the flames, just like my mother had.\n\n\n\nPanic surged through me, and I instinctively reached into my pocket, my fingers fumbling around the knife I had kept there for protection. My vision blurred with smoke and pain, but I gripped the handle tightly, my breath coming in ragged gasps as I mustered all the strength I had left. \n\n\n\nWith a wild, desperate motion, I yanked the knife free and plunged it into Roger’s side.\n\n\n\nHe let out a howl of pain, staggering back and releasing his grip on me. His hands went to the wound, his face contorting in fury as blood oozed between his fingers. “You little—” he cursed through gritted teeth, and before I could react, he kicked me hard in the ribs. The impact knocked the wind out of me, sending me collapsing onto my side, gasping for air.\n\n\n\nRoger stared at the knife embedded in his side, his scowl deepening, as if he couldn’t believe what had just happened. He glanced down at me, his eyes blazing with hatred. “You just needed to sleep and burn,” he growled, his voice cold and venomous. “You weren’t supposed to wake up.”\n\n\n\nI coughed, struggling to breathe, my body screaming in pain, but his words echoed in my mind. This was the plan all along. He had set the fire, expecting me to die quietly in my sleep, trapped in the house as it burned down around me.\n\n\n\nBut I hadn’t stayed asleep. I hadn’t given him what he wanted.\n\n\n\nRoger’s eyes flickered with frustration, his hands trembling slightly as he grasped the knife’s handle. He took a step toward me, his face twisted with rage and pain. But I knew I had to act quickly. If I didn’t, this nightmare would end exactly the way he wanted it to.\n\n\n\nAdrenaline surged through me, overriding the pain in my body as I scrambled to my feet. Every muscle screamed in protest, but I knew this was my only chance. Roger was already trying to steady himself, his eyes locked on me with fury. I lunged at him, tackling him to the ground, my fists swinging wildly.\n\n\n\nI hit him in the face, over and over, feeling the crunch of bone beneath my knuckles. Roger grunted with each blow, but he fought back hard. His fists connected with my ribs, my face, sending sharp waves of pain coursing through me. But I couldn’t stop. I *wouldn’t* stop. Every hit felt like it was releasing months of fear, frustration, and anger.\n\n\n\nBlood poured from his face, but his hands were still trying to claw at me, his strength not yet gone. In a moment of desperate clarity, I reached down and grabbed the handle of the knife still lodged in his side. My grip tightened as I yanked it free, and without thinking, I plunged it back into him. Again and again.\n\n\n\nI stabbed him over and over, each thrust fueled by the terror he had put me through, by the deaths of Patricia, my mother, and the threat to my brother’s family. The knife sank into him, each strike weakening him further, until finally, his body went still. His hands fell away from me, limp and lifeless.\n\n\n\nI stared down at him, gasping for breath, my entire body trembling. The sound of the fire roaring inside the house was deafening, but I could no longer hear Roger’s labored breathing or his curses. He wasn’t moving anymore.\n\n\n\nI collapsed beside him, my body giving in to the exhaustion and pain. My hands were covered in blood, my mind barely able to process what had just happened. I killed him. It was over.\n\n\n\nSirens blared in the distance, growing louder with each passing second. The police and fire department had arrived. I could see the flashing red and blue lights as they pulled up to the house, the firefighters rushing toward the flames, while officers sprinted toward the backyard.\n\n\n\nI looked at Roger’s body one last time, the knife still clutched in my hand, and I let it fall to the ground as the first officer reached me.\n\n\n\nThe aftermath of the fire was worse than anything I could have imagined. My brother and his entire family—his wife, my nephews—they all perished in the blaze. The fire had spread too fast, too violently. By the time the fire department managed to get inside, it was too late. My heart shattered. I had escaped, but they hadn’t. The guilt of that reality pressed down on me like a weight I could never shake. I had come to them for safety, and now they were gone because of it.\n\n\n\nWhen the police questioned me, I told them the truth—about Roger, the stalking, the threats, the torment I had endured for months. I explained how he had orchestrated everything, from Patricia’s death to my mother’s, and finally, the fire that had taken my brother’s family. The man I had killed was Roger, my mother’s half-brother, the ghost that had haunted us all. \n\n\n\nThe police found Roger’s truck parked a few blocks away in a fast-food parking lot. Inside, they uncovered a laptop and several burner phones—the tools he had used to send the messages, track me, and lay out his twisted plans. Nearby, they discovered empty cans that had been used to ignite the fire. The forensic team confirmed that the accelerants were the source of the blaze. It was all there, meticulously planned, as if Roger had been preparing for this final act for years.\n\n\n\nAfter the investigation wrapped up, I moved in with my father. We were the only ones left—the only survivors of Roger’s horrific onslaught. The police found detailed notes in Roger’s belongings, a sick diary chronicling his hatred for his family and his twisted justification for killing them all. He had been abused as a child, and that trauma had warped him, leading him to believe that his revenge was justified. He had vowed to kill everyone connected to his bloodline, and that included us.\n\n\n\nThe grief was overwhelming, almost too much to bear. But my father and I held on to each other, leaning on the only family we had left. We spent the year healing, though the wounds would never fully close. We missed my mother, my brother, and his family every single day. The ache of their absence was constant, but staying close to my dad helped us both get through the worst of it.\n\n\n\nWe had lost nearly everything, but we still had each other. And slowly, with time, we began to rebuild, piece by piece, determined not to let Roger’s darkness consume what little remained of our lives.\n\n",
        "You wake up suddenly, the sound of relentless banging echoing in your ears. Confused and disoriented, you turn your head to find your phone lying beside you. The banging intensifies, accompanied by an unmistakable voice—Stewie from Family Guy—calling out, \"Let me in! Let me in!\" A shiver runs down your spine as the memories of last night flood back: you had fallen asleep to the familiar antics of that cartoon. It was supposed to be a comforting distraction.\n\n\n\nThe urgency of the knocks seems to pulse with your heartbeat, each thud echoing through the silence of the room. You sit up, fear gripping you, realizing the door is locked, yet the sounds persist. A pit forms in your stomach as you grab your phone, desperate for some semblance of reality. But as you clutch it tightly, it crumbles into dust, disintegrating in your hands. \"What the hell is happening?\" you murmur, your voice barely a whisper against the cacophony outside.\n\n\n\nPanic takes hold as the voices of Stewie, Brian, and Peter seep through the cracks of your mind. “Let me in!” they plead, but all you can manage is a feeble, “Leave me alone!” The words are barely audible, lost in the chaos swirling around you. As you attempt to stand, your legs betray you, refusing to obey your commands. Your body feels foreign, as if you’re trapped in a dream where reality slips further from your grasp.\n\n\n\nSuddenly, you drift back into unconsciousness, falling into another layer of this nightmarish cycle.\n\n\n\nWhen you wake up again, the world has shifted once more. The voices persist, but now they emanate solely from your phone, which sits just out of reach. You blink in confusion, realizing that Stewie is still outside, his taunting laughter ringing in your ears. The characters challenge you again, demanding that you scream profanities to be left alone. Desperation surges within you, but your lips are frozen, as if held in place by some malevolent force. You manage to choke out two profanities, but they come out garbled and indistinct, each word a futile attempt to assert your will.\n\n\n\nFrustration bubbles within you as you drag your body toward the door, your hands clawing at the ground like a wounded animal. You manage to pull yourself along, inch by agonizing inch, but just as you reach for your phone, it crumbles again, slipping through your fingers like sand. A sense of dread washes over you, tightening its grip as the reality of your situation sinks in.\n\n\n\nYou slip into sleep once more, but when you awaken this time, the atmosphere has shifted drastically. The room is now filled with the presence of police officers, their stern faces looking down at you. Your parents are there too, frantically cleaning up the mess you’ve made—puke splattered across the floor, sheets stained with your despair. Your heart sinks as they turn to you, their voices cold and unyielding. “We’re not going to support you anymore. You’re on your own,” they declare, the weight of their words suffocating you.\n\n\n\nThe officers regard you with suspicion. “What’s going on here?” one asks. You struggle to form the words, desperation clawing at your throat. “I was watching Family Guy…,” you manage to croak, your voice cracking under the pressure. “They started haunting me…” But as the words leave your lips, you feel the familiar tightness return. Your lips are once again stuck, rendering you mute in the face of authority.\n\n\n\nThe police officer rolls his eyes. “Just tell me the name of the drug you’re on, man. It’s clear you’re on something.” Their words pierce through your humiliation, deepening the sense of isolation.\n\n\n\nAcross the room, a family—one that isn’t real, yet somehow feels intimately familiar—looks on with disdain. They laugh at your plight, a chorus of mockery that echoes in your mind. Your cheeks flush with shame as their laughter reverberates, drowning you in despair. You feel small, like a child caught in a nightmare, unable to escape the judgment of those around you.\n\n\n\nIn a desperate bid to escape, you slip into unconsciousness once more.\n\n\n\nThis time, you wake up and find yourself in a familiar room, but everything feels strangely off. You try to move, desperate to escape this torment, but as you stand, the walls seem to stretch beyond your understanding, the room expanding into an endless void. You stumble, overwhelmed, until the nausea rises within you like a wave. You drag yourself to the washroom, feeling larger than life yet smaller than a whisper.\n\n\n\nAnd then it happens. You are struck by the urge to purge, the bile rising in your throat as you lose control. You puke everywhere—the floor, the walls, and even your sheets become a canvas of your despair. The stench fills the air, mixing with the echo of your own helplessness. It’s a grotesque reflection of your mental state, a chaotic swirl of confusion and horror. You collapse against the cold tiles, tears streaming down your face, but the relief is fleeting.\n\n\n\nFinally, you drag yourself back to bed, exhausted and defeated, only to succumb to sleep once again.\n\n\n\nWhen you wake up, the atmosphere is eerily calm. You find yourself in the same room, your phone once again at your side. The familiar sounds of Family Guy play softly in the background, but you can finally hold your phone—this time, it doesn’t crumble. You recognize the episode playing; you’ve watched all the seasons multiple times. Yet something feels off as you realize it’s an episode you’ve never seen before. \n\n\n\nPewter Schmidt—Lois’s father—appears on the screen, speaking directly to the characters. Suddenly, he turns his gaze toward you, his voice slipping into the realm of the uncanny. “You think you can escape?” he taunts, a sinister grin spreading across his face. A cold chill runs down your spine as the walls around you seem to close in, reality blurring into something nightmarish once again.\n\n\n\nAs you try to speak, you feel that familiar sensation returning. Your lips are stuck, the words caught in your throat, leaving you voiceless in the face of this new terror. Just when you think you’ve grasped reality again, the phone crumbles yet again, slipping from your grip, dragging you back into the abyss.\n\n\n\nYou drift into a deeper sleep, wondering if you will ever wake up again—if there is a way to break free from this twisted cycle. Or if you are destined to repeat this nightmare forever, trapped in the endless loop of horror and despair.."
    ],
    "author": [
        "RedRiverofTime",
        "Good_Barracuda2409",
        "Vo1dFai3y",
        "Ser1724",
        "MSM_Xeno13",
        "nashtyboii",
        "psychobillybride",
        "smashsharp",
        "LCDatkin",
        "Ok-Statistician8651"
    ]
}